Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་སོམ་ཉི་མི་ཟ་ཞིང་། ཡིད་གཉིས་མེད་དེ་ཐེ་ཙོམ་ཟ་བར་ཡང་མི་འགྱུར་རོ། །
en: They will not be skeptical or ambivalent or entertain doubts about the attainment of unsurpassed, complete, and perfect awakening.

source: འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པའི་ཡུལ་ཤེས་པར་ཡང་འགྱུར་རོ། །
en: They will understand what is necessary to act in harmony with the world.”

source: དེ་ནས་དེའི་ཚེ་འཁོར་ཆེན་པོའི་ནང་ནས་ལྷའི་བུ་དྲི་མ་མེད་པའི་འོད་ཀྱི་ཕྲེང་བ་ཅན་ཞེས་བྱ་བ་ལྷའི་བུ་ས་ཡ་དང་། བརྒྱད་འབུམ་དང་ལྷན་ཅིག་ཏུ་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེཔུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ།
en: At that time the devaputra known as Garland of Stainless Light and one million eight hundred thousand other devaputras stood up all at once from their seats within the assembly and, draping their robes over one shoulder, touched their right knees to the ground and bowed toward the Bhagavān with both palms joined, touching their heads to his feet.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ལྷའི་མེ་ཏོག་དང་། ཙན་དན་གྱི་ཕྱེ་མས་བསྒོ་བ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་གཏོར་ཏེ། རང་རང་གི་བླ་གོས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གསོལ་ནས་ཁ་འཐུན་པར་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: They scattered divine flowers and sandalwood powder over the Tathāgata, and after each of them had draped their own robe over the Bhagavān’s body, they spoke these verses with one voice:

source: ཀྱེ་མ་བཅོམ་ལྡན་སངས་རྒྱས་ནི། །བསམ་ཡས་དཔག་མེད་དེ་བཞིན་གཤེགས། །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །ཆར་ཆེན་རྣམ་པ་སྣ་ཚོགས་འབེབས། །
en: “O Bhagavān, Buddha, Inconceivable, unfathomable Tathāgata— As medicine for all sentient beings, May you shower down various types of great rainfall.”

source: ཏིང་ངེ་འཛིན་གྱི་ལེའུ་ཞེས་བྱ་སྟེ་གཉིས་པའོ།། །།
en: This concludes the second chapter, on samādhi.

source: ཤིན་ཏུ་རྒྱས་པ་ལས་ཕྱི་རོལ་པ་འོན་པ་ལྟ་བུར་གྱུར་པ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོའི་རྣ་བའི་ཁམས་ཡོངས་སུ་རྫོགས་པར་བགྱི་བའི་སླད་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱིར་མི་ཟློག་པའི་ཡེ་ཤེས་མཐའ་ཡས་པ་རིན་པོ་ཆེའི་འབྱུང་གནས་ལ་མངོན་པར་འཇུག་པ་ཞེས་བགྱི་བའི་གཟུངས་ཀྱི་ཆོས་ཀྱི་སྒོའི་གཞི་སུམ་ཅུ་རྩ་དྲུག་སྔར་སྨོས་ཏེ་བཞག་པ་རྒྱས་པར་བཤད་དུ་གསོལ།
en: “Those outsiders who have turned away from these great Vaipulya teachings have become as though deaf; in order to make them whole with the ear faculties of the Great Vehicle, I beseech the Bhagavān to give an extensive explanation of those previously mentioned thirty-six Dharma gateways of dhāraṇī called directly entering the jewel mine of the infinite gnosis of irreversibility.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Bhagavān replied,

source: སྤྲིན་ཆེན་སྙིང་པོ་ཕྱིར་མི་ཟློག་པའི་ཡེ་ཤེས་མཐའ་ཡས་པ་རིན་པོ་ཆེའི་འབྱུང་གནས་ལ་མངོན་པར་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས་ཀྱི་ཆོས་ཀྱི་སྒོ་སུམ་ཅུ་རྩ་དྲུག་རྒྱ་ཆེར་ཉོན་ཅིག །
en: “Great Cloud Essence, listen well as I give an extensive explanation of the thirty-six Dharma gateways of dhāraṇī called directly entering the jewel mine of the infinite gnosis of irreversibility.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕྱིར་མི་ཟློག་པའི་འཁོར་ལོ་རིན་པོ་ཆེའི་མཛོད་ཅེས་བྱ་བའི་གཟུངས་དང་།
en: “Great Cloud Essence, within the inconceivable domain of this Great Cloud discourse, there is the dhāraṇī called precious storehouse of the wheel of the irreversibility of all tathāgatas and bodhisattvas.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་དྲི་མ་མེད་པའི་སྙིང་པོའི་ཆུ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called water of the stainless essence of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་སྙིང་པོ་སྣང་བ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called brilliant essence of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་ཆུའི་བློ་གྲོས་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called intelligence of the water of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་ཆུའི་རྒྱུན་ཅེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called flowing water of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་ཟད་མི་ཤེས་པའི་བློ་གྲོས་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called inexhaustible intellect of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་གློག་གི་འོད་མྱུར་བ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called swift lightning of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་གློག་གི་འོད་དང་ལྡན་པ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called endowed with the lightning of the essence of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called stainless light of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་ཏོག་གི་བློ་གྲོས་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called intellect of the emblem of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་སྙིང་པོ་གཏེར་གྱི་རྒྱལ་པོའི་འོད་འཕྲོ་བའི་བློ་གྲོས་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called radiant intellect of the king of the essential treasury of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་གློག་གི་སྒྲ་སྒྲོགས་པ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called thunderclap of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་མྱུར་བའི་དཔལ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called swift glory of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་ནམ་མཁའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called king of space of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་སྨན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called great medicine king of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་ཆར་འབབ་པའི་མཚོའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called king of the oceanic flow of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་ཀུན་ཏུ་རྒྱས་པར་བྱེད་པ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called all-pervading spread of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་ཏི་སེའི་གངས་ཅན་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called Mount Kailāśa of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་ནམ་མཁའི་བློ་གྲོས་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: “There is the dhāraṇī called space-like intellect of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་མངོན་པར་འཕགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called superior king of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་དུས་ཚོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called king of the tides of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་ངང་པ་དགའ་བའི་སྐད་འབྱིན་པ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called joyful call of the swan of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་ཡེ་ཤེས་ཀྱི་རླུང་གི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called seal of the wind of gnosis of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་ཟབ་མོའི་བློ་གྲོས་བརྩོན་འགྲུས་རྒྱལ་པོ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called resolute king of the profound intellect of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་ས་བོན་གྱི་ཆར་འབེབས་པ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called shower of seeds of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་སའི་ཕྲེང་བ་ཅན་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called earth garland of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་དགའ་བར་བྱེད་པའི་རླུང་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called delightful wind of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་སྣང་བའི་བློ་གྲོས་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called brilliant intellect of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་གཡོ་བར་བྱེད་པ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called shaking of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་སྙིང་པོ་ཚུལ་གྱིས་རྣམ་པར་བརྒྱན་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called king of adornment in the essential manner of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་མཛོད་ཅེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called treasury of the essence of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆུའི་སྟོན་པ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called display of the water of the essence of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་ཟད་མི་ཤེས་པའི་ཆུ་སྲུང་བ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called protector of the water of the great cloud of irreversibility that knows no exhaustion.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་ཆུའི་ཀུ་མུ་དའི་ཟླ་བ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called moonlight-blossoming kumuda of the water of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་གཞི་འཛིན་པ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: There is the dhāraṇī called foundation of the essence of the great cloud of irreversibility.

source: ཕྱིར་མི་ཟློག་པའི་སྤྲིན་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པའི་བློ་གྲོས་རྒྱ་མཚོའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་གཟུངས་ཡོད་དེ
en: There is the dhāraṇī called king of the inconceivable oceanic intellect of the great cloud of irreversibility.

source: སུམ་ཅུ་རྩ་དྲུག་པོ་དེ་དག་ནི་ཕྱིར་མི་ཟློག་པའི་ཡེ་ཤེས་མཐའ་ཡས་པ་རིན་པོ་ཆེའི་འབྱུང་གནས་ལ་མངོན་པར་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས་ཀྱི་སྒོ་སྟེ།
en: These thirty-six are the dhāraṇī gateways called directly entering the jewel mine of the infinite gnosis of irreversibility.

source: དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རྩིས་མཁན་གྱི་རྒྱལ་པོར་འགྱུར་རོ། །
en: Bodhisattvas who possess these will become kings of astrological reckoning.”

source: དེ་ནས་དེའི་ཚེ་འཁོར་ཆེན་པོའི་ནང་ནས་ལྷ་མོ་རིན་པོ་ཆེའི་ཕྲེང་བའི་གཟུངས་ལ་དགའ་བ་ཞེས་བྱ་བ་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་བར་སྣང་ལ་འདུག་སྟེ།
en: At that time, a goddess named Rejoices in the Dhāraṇī of the Precious Garland rose from the great assembly.

source: བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་གི་ཆར་རབ་ཏུ་ཕབ་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: Poised in midair, at a height equal to that of seven palm trees, she sent down a rain of flowers upon the Bhagavān and uttered these verses to him:

source: ཡེ་ཤེས་དཔའ་བོ་ཆེན་པོ་མི་མཉམ་མཉམ། །དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་སྲ་བའི་སྐུ། །རིག་པའི་རྒྱལ་པོ་སྒྱུ་འཕྲུལ་ཆེན་པོ་པ། །མི་ཡི་པད་མ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Great unequaled hero of gnosis, Tathāgata, your body as solid as a vajra, King of knowledge, master of great illusory emanation— With these lotus blossoms, I pay homage to you.

source: གཟུངས་སོ་ཅོག་གིས་འབྲུག་གི་སྒྲ་བསྒྲགས་ཏེ། །དེ་བཞིན་གཤེགས་པས་ཆོས་ཆར་རབ་ཏུ་ཕབ། །
en: “Thunderously proclaiming all these dhāraṇīs, The Tathāgata has sent down a rain of Dharma.

source: སེམས་ཅན་རྣམས་ལ་ཕན་པ་མཛད་སླད་དུ། །ཆོས་རྣམས་སྣ་ཚོགས་རབ་ཏུ་སྟོན་པ་མཛད། །
en: To accomplish the welfare of all sentient beings, You teach these various dharmas.”

source: གཟུངས་ཀྱི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་གསུམ་པའོ།། །།
en: This concludes the third chapter, on the topic of dhāraṇī.

source: སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་པ།
en: Great Cloud Essence then said,

source: སེམས་ཅན་མི་གསལ་ཞིང་གླེན་ལ། སེམས་རྟུལ་བ། མུན་པ་ཆེན་པོར་ཞུགས་པ་རྣམས་ལ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་ཤེས་པའི་སྒྲོན་མའི་འོད་ཟེར་ཕྲ་མོ་རབ་ཏུ་དགྱེ་བར་གསོལ།
en: “In order to tame the minds of unawakened and foolish sentient beings, I beseech you to shine the subtle light rays of the lamp of understanding the concealed intent of the Bhagavān Tathāgata’s speech upon all those who have entered great darkness.”

source: སྤྲིན་ཆེན་སྙིང་པོ་ལྡེམ་པོ་ངག་གི་གཞིའི་བྱེ་བྲག་ལ་འཇུག་པ་ལ་རྨོངས་པའི་ཚུལ་ཅན་གྱི་ཆོས་ཐབས་ཀྱི་རྒྱུན་གྱི་རྣམ་པར་ཐར་པའི་སྒོ་ཉི་ཤུ་རྩ་གསུམ་རྒྱས་པ་རབ་ཏུ་འབར་བར་གྱིས་ཤིག །
en: “Great Cloud Essence, you must broadly ignite the twenty-three liberation gateways of the continuous flow of skillful methods of Dharma for those who are ignorant of how to enter into the fundamental divisions of the concealed intent of the Tathāgata’s speech.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་བདག་ཏུ་འཛིན་ཅིང་བདག་གིར་འཛིན་ལ།
en: “Great Cloud Essence, within this Great Cloud discourse there is the liberation gateway of the continuous flow of skillful methods of Dharma for those who are ignorant of how to enter the fundamental divisions of the concealed intent of the Tathāgata’s speech.

source: བདག་ཏུ་འཛིན་པ་མེད་ཅིང་བདག་གིར་འཛིན་པ་མེད་པ་ཞེས་བྱ་བའི་ལྡེམ་པོ་ངག་གམ།
en: It is called having no grasping at ‘I’ and ‘mine’ amid the grasping for ‘I’ and ‘mine.’

source: གཞིའི་བྱེ་བྲག་ལ་འཇུག་པ་ལ་རྨོངས་པའི་ཚུལ་ཅན་གྱི་ཆོས་ཀྱི་ཐབས་ཀྱི་རྒྱུན་གྱི་རྣམ་པར་ཐར་པའི་སྒོ་དང་། འཇིགས་པའི་ཚུལ་དང་། ཕལ་པའི་ཚུལ་དུ་འཇུག་ལ་འཇིགས་པ་མེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called having no fear amid involvements in dangerous or mundane ways of being.

source: འདོད་ཆགས་ཀྱི་སྦྱོར་བ་ཡོད་ལ། འདོད་ཆགས་དང་བྲལ་བ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called freedom from desire amid involvement in desires.

source: སྐྱོན་དང་སྐྱོན་རབ་དང་ལྡན་ལ་སྐྱོན་མེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called having no faults in the midst of faults and egregious faults.

source: གཏི་མུག་ཅིང་རབ་ཏུ་གཏི་མུག་ལ་གཏི་མུག་ཀྱང་མེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called having no delusion in the midst of delusion and acute delusion.

source: འདོད་ཆགས་ཤིང་རབ་ཏུ་འདོད་ཆགས་ལ་འདོད་ཆགས་དང་བྲལ་བ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called freedom from desire in the midst of desire and acute desire.

source: ཆགས་ཤིང་ཤིན་ཏུ་ཆགས་ལ་ཆགས་པ་མེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called having no attachment in the midst of attachment and acute attachment.

source: ཞེན་ཅིང་ཤིན་ཏུ་ཞེན་ལ་ཞེན་པ་མེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called having no clinging while in the midst of clinging and acute clinging.

source: སྐྱོན་ཆགས་ཤིང་རབ་ཏུ་སྐྱོན་ཆགས་ལ་སྐྱོན་ཆགས་པ་མེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called having no defilement in the midst of defilement and acute defilement.

source: མུན་གནག་ཅིང་ཤིན་ཏུ་གནག་ལ་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called fully illuminated in the midst of darkness and acute darkness.

source: རྟུལ་ཞིང་རབ་ཏུ་རྟུལ་ལ་ཤིན་ཏུ་རྣོ་བ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called being very sharp in the midst of dullness and acute dullness.

source: གཅོད་ཅིང་འབྱེད་ལ་ཤིན་ཏུ་སྙིང་བརྩེ་བ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called having great love in the midst of cutting and dividing.

source: བརླང་ཞིང་ཤིན་ཏུ་སྡིག་བྱེད་ལ་བྱམས་པ་ལ་སོགས་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་དང་།
en: “There is the liberation gateway called possessing kindness and so forth in the midst of abusiveness or heinous conduct.

source: སྦྱིན་པ་ལ་སྨོད་ཅིང་རབ་ཏུ་སྨོད་ལ་སྦྱིན་པ་བསྔགས་པར་བྱེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called praising generosity amid condemning or strongly condemning generosity.

source: སྨད་ཅིང་ཤིན་ཏུ་སྨད་ལ་སྨད་དུ་མེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called not being slanderous amid slander or egregious slander.

source: རྟག་ཏུ་བདག་སྟོད་ཅིང་གཞན་སྨོད་ལ་ལས་ཀྱང་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called purifying karma amid constant self-praise and disparagement of others.

source: ཆགས་ཤིང་རབ་ཏུ་ཆགས་ལ་ཆགས་པ་ཡང་མེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called having no attachment in the midst of attachment or acute attachment.

source: མི་མཉམ་ཞིང་ཤིན་ཏུ་མི་མཉམ་ལ་མི་མཉམ་པ་ཡང་མ་ཡིན་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called not lacking balance in the midst of what is unbalanced or acutely unbalanced.

source: སྡུག་བསྔལ་ཞིང་མི་བདེ་ལ་བདེ་བ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called being satisfied amid dissatisfaction and unhappiness.

source: སྟོང་ཞིང་ཤིན་ཏུ་སྟོང་ལ་སྟོང་པ་མ་ཡིན་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called not being vacuous amid vacuousness and acute vacuousness.

source: མི་རྟག་ཅིང་ཤིན་ཏུ་མི་རྟག་ལ་ཤིན་ཏུ་རྟག་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called consummate permanence amid impermanence and acute impermanence.

source: བདག་མེད་པར་གྱུར་ལ་ཤིན་ཏུ་བདག་ཉིད་དུ་གྱུར་པ་ཞེས་བྱ་བ་དང་།
en: There is the liberation gateway called consummate selfhood amid the absence of self.

source: མི་སྡུག་ཅིང་ཤིན་ཏུ་མི་སྡུག་ལ་ཤིན་ཏུ་སྡུག་པ་ཞེས་བྱ་བ་ཡོད་དེ
en: And there is the liberation gateway called consummate happiness amid unhappiness and acute unhappiness.

source: ཉི་ཤུ་རྩ་གསུམ་པོ་དེ་དག་ནི་ལྡེམ་པོ་ངག་གི་གཞིའི་བྱེ་བྲག་ལ་འཇུག་པ་ལ་རྨོངས་པའི་ཚུལ་ཅན་གྱི་ཆོས་ཀྱི་ཐབས་ཀྱི་རྒྱུན་གྱི་རྣམ་པར་ཐར་པའི་སྒོ་ཡིན་ནོ། །
en: These twenty-three are the liberation gateways of the continuous flow of skillful methods of Dharma for those who are ignorant of how to enter the basic divisions of the concealed intent of the Tathāgata’s speech.”

source: དེ་ནས་དེའི་ཚེ་འཁོར་ཆེན་པོའི་ནང་ནས་ལྷའི་བུ་སྐྱེ་བོ་ཐམས་ཅད་དགའ་བ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་མཆོད་པ་ཆེན་པོ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a devaputra named Delight of All Beings set forth from the great assembly and, after having made divine offerings to the Bhagavān, uttered this verse:

source: ཀྱེ་མ་དེང་ནི་ཉན་ཐོས་ཀུན། །མྱོས་པར་བྱེད་པའི་རྒྱུ་ཆེན་བྱུང་། །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །ལྷ་ཆེན་མཐའ་ཡས་གཟུགས་མངའ་བ། །དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག །ཐུགས་སུ་ཆུད་ནས་སྟོན་པ་མཛད། །
en: “Ah! Presently, all the śrāvakas Gave rise to the great, intoxicating causal factor By which they take form as innumerable great gods To serve as medicine for all sentient beings. Having taken to heart the concealed intent of the Tathāgata’s speech, They will teach it to others!”

source: ལྡེམ་པོ་ངག་གི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བཞི་པའོ།། །།
en: This concludes the fourth chapter, on the topic of the concealed intent of the Tathāgata’s speech.

source: སྲིད་པར་སྐྱེ་བས་རྩེ་བའི་རྣམ་པ་ལ་འཇུག་ཅིང་གནས་པ་བགྲོད་པའི་གསང་བ་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱས་པར་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to give an extensive explanation of the ten Dharma gateways called king of the wondrous secret of the way to engage and abide in the playful appearance of taking birth in cyclic existence.”

source: སྤྲིན་ཆེན་སྙིང་པོ། སྤྲིན་ཆེན་པོའི་མདོ་ལ་སྲིད་པར་སྐྱེ་བས་རབ་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “Great Cloud Essence, within this Great Cloud discourse, there is the Dharma gateway called king of utter delight at being born within existence.

source: སྲིད་པར་སྐྱེ་བ་ལ་འདོད་ཅིང་བློ་གྲོས་དང་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called desiring and delighting in birth within existence.

source: སྲིད་པར་སྐྱེ་བ་ལ་སྲེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called thirsting for birth within existence.

source: སྲིད་པར་སྐྱེ་བ་ལ་བརྩམ་པ་མེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called beginningless birth within existence.

source: སྲིད་པར་སྐྱེ་བ་ལ་རབ་ཏུ་དད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called utmost faith in birth within existence.

source: སྲིད་པར་སྐྱེ་བར་སྨོན་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called skill in the aspiration to be born within existence.

source: སྲིད་པར་སྐྱེ་བའི་བསྔགས་པ་རྗོད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called singing the praises of birth within existence.

source: སྲིད་པར་སྐྱེ་བ་ལ་དམིགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of observing birth within existence.

source: སྲིད་པར་སྐྱེ་བ་ལ་མཁས་པའི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called powerful king of skill in birth within existence.

source: སྲིད་པར་སྐྱེ་བ་ན་མི་དགེ་བའི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱིས་མ་གོས་པར་གནས་ཤིང་འཇུག་པ་གསང་བའི་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དེ
en: And there is the Dharma gateway called king of the wondrous secret of engaging and abiding in the state of not being obscured by the various categories of unwholesome dharmas when born within existence.

source: བཅུ་པོ་དེ་དག་ནི་སྲིད་པར་སྐྱེ་བས་རྩེ་བའི་རྣམ་པ་ལ་འཇུག་ཅིང་གནས་པ་བགྲོད་པའི་གསང་བ་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called king of the wondrous secret of the way to engage and abide in the playful appearance of taking birth in cyclic existence.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་རྒྱ་ཆེར་དགའ་བ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱས་ནས། ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: At that time, a goddess named Vast Delight made offerings to the Bhagavān and uttered this verse:

source: མ་སྐྱེས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to you, unborn one!

source: དེ་བཞིན་གཤེགས་པ་ཐབས་ཀྱི་སྐུ། །སྲིད་པར་སྐྱེ་བ་སྣ་ཚོགས་པ། །དྲི་མེད་ཐམས་ཅད་ཐུབ་པས་བསྟན། །
en: The Tathāgata’s body of skillful means Is born within existence in various forms, All of which, being stainless, give teachings as munis.

source: དཔའ་བོ་ཆེན་པོ་རྟག་པའི་སྐུ། །སྲིད་སྐྱེའི་དགྱེས་པ་རྒྱ་མཚོ་མངའ། །
en: The permanent body of the great hero Takes oceanic delight in being born within existence.

source: གོས་པ་མེད་པའི་དེ་བཞིན་གཤེགས། །འཁོར་བ་དག་ནི་དགེ་བར་བཞེད། །
en: The unobscured Tathāgata Joyfully accepts many cycles through existence.”

source: སྲིད་པར་སྐྱེ་བའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་ལྔ་པའོ།། །།
en: This concludes the fifth chapter, on the topic of birth within existence.

source: འཁོར་བའི་ཉོན་མོངས་པའི་ཞིང་གི་ལས་ཀྱི་ས་ཐོབ་པར་བགྱི་བའི་སླད་དུ། སེམས་ཀྱིས་ཡང་དག་པར་ལེན་པའི་རྣམ་པར་གྲོལ་བའི་སྨོན་ལམ་གསང་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱས་པར་བཤད་དུ་གསོལ། དེ་བཞིན་གཤེགས་པས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called the secret aspiration to liberation, which is taken up by the mind in order to attain the karmic ground of the field of the afflictions of cyclic existence.”

source: འཁོར་བའི་ཉོན་མོངས་པའི་ཞིང་གི་འབྲས་བུ་འཐོབ་པ་ཞེས་བྱ་བ་དང་།
en: “There is the Dharma gateway called obtaining the fruit of the field of the afflictions of cyclic existence.

source: འཁོར་བའི་ཉོན་མོངས་པའི་ཞིང་ལ་དགའ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of delighting in the field of the afflictions of cyclic existence.

source: འཁོར་བའི་སྦྱོར་བ་ལ་སེམས་གནས་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called fixing the mind on the connection with cyclic existence.

source: འཁོར་བ་ལ་མཆོག་ཏུ་དགའ་བའི་གཟུངས་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called dhāraṇī of supreme delight in cyclic existence.

source: འཁོར་བར་འགྲོ་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called migrating within cyclic existence.

source: འཁོར་བར་ཤིན་ཏུ་ཆར་འབེབས་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called thoroughly raining down upon cyclic existence.

source: འཁོར་བ་རྒྱུན་མི་གཅོད་པའི་རླུང་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the uninterrupted wind of the continuity of cyclic existence.

source: འཁོར་བའི་ཆོམ་རྐུན་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called thief of cyclic existence.

source: འཁོར་བའི་རྩ་བའི་སྤྱོད་ཡུལ་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called stainless domain of the root of cyclic existence.

source: འཁོར་བ་ན་ཡུན་རིང་དུ་གནས་པ་རྣམས་ལ་སྣང་བར་བྱེད་པ་ཞེས་བྱ་སྟེ
en: And there is the Dharma gateway called bringing illumination to all those who abide for a long time in cyclic existence.

source: བཅུ་པོ་དེ་དག་ནི་འཁོར་བའི་ཉོན་མོངས་པའི་ཞིང་གི་ལས་ཀྱི་ས་ཐོབ་པར་བྱ་བའི་ཕྱིར་སེམས་ཀྱིས་ཡང་དག་པར་ལེན་པའི་རྣམ་པར་གྲོལ་བའི་སྨོན་ལམ་གསང་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called the secret aspiration to liberation, which is taken up by the mind in order to attain the karmic ground of the field of the afflictions of cyclic existence.”
